export const BEA_QUESTIONS = {
  question1: [
    {
      key: 1,
      question1:
        "ブランド活動とは、すべての部署で考え、取り組む活動であると私は考えている",
    },
    {
      key: 2,
      question1:
        "ブランドとは、商品やサービスの名称やロゴをかっこよくしたり、わかりやすくする取り組みであると私は考えている",
    },
    {
      key: 3,
      question1:
        "ブランド活動には、顧客や取引先等に向けた活動を指し、社内に対して取り組む活動は含まれないと私は考えている",
    },
    {
      key: 4,
      question1:
        "経営層や上司から、現在の会社の状況（売上や競合他社との関係　等）について説明を聞いたことがある",
    },
    {
      key: 5,
      question1:
        "経営層や上司は、現在の組織の状態を「危機的状況」と感じていると思う",
    },
    { key: 6, question1: "当社は、現在「危機的状況」に直面していると感じる" },
    {
      key: 7,
      question1:
        "当社のビジネスは今のままでも、将来的に「危機的状況」には陥らないと感じている",
    },
    { key: 8, question1: "当社が現状のままの場合、将来どうなるか想像できる" },
    { key: 9, question1: "当社には今、変革が必要だと感じる" },
    { key: 10, question1: "当社の将来について心配はしていない" },
  ],
  question2: [
    {
      key: 11,
      question1: "当社や業界を取り巻く外部環境が大きく変化していると感じている",
    },
    {
      key: 12,
      question1: "私は、現在　仕事をする上で仕事をしづらいと感じることがある",
    },
    { key: 13, question1: "私は、現在　雇用に対する不安を感じることがある" },
    {
      key: 14,
      question1:
        "私は、このまま当社で仕事を続けていれば、将来　雇用に対する不安はないと感じている",
    },
    {
      key: 15,
      question1:
        "上司や会社から、なぜ今　組織変革する必要性があるか説明を聞いたことがある",
    },
    {
      key: 16,
      question1:
        "所属チーム（部署）のメンバーは、当社が現在「危機的状況」に直面していると感じている人が多い",
    },
    {
      key: 17,
      question1:
        "所属チーム（部署）のメンバーは、当社が現状のままでも、将来的に「危機的状況」には陥らないと感じている人が多い",
    },
    {
      key: 18,
      question1:
        "経営層や上司から、当社の「将来の姿」や「ビジョン（目指す姿）」についての説明を聞いたことがある",
    },
    {
      key: 19,
      question1:
        "経営層や上司から、当社の「将来の姿」や「ビジョン（目指す姿）」の実現に向けた「熱意」を感じることができる",
    },
    {
      key: 20,
      question1:
        "組織変革に取り組んだ場合に、当社がどのようになるかイメージできる",
    },
  ],
  question3: [
    {
      key: 21,
      question1:
        "組織変革に取り組んだ場合、期待されている効果を実現できると確信している",
    },
    {
      key: 22,
      question1:
        "組織変革に取り組んだ場合、期待されている目的を達成できるか、疑わしいと感じている",
    },
    {
      key: 23,
      question1: "組織変革に取り組んだ場合、当社は良い方向に変わっていける",
    },
    { key: 24, question1: "当社の未来は明るいと強く信じている" },
    {
      key: 25,
      question1:
        "所属チーム（部署）のメンバーは、組織変革に取り組んだ場合、期待されている効果を実現できると確信している人が多い",
    },
    {
      key: 26,
      question1:
        "所属チーム（部署）のメンバーは、組織変革に取り組んだ場合、期待されている目的を達成できるか、疑わしいと感じている人が多い",
    },
    {
      key: 27,
      question1:
        "所属チーム（部署）のメンバーは、会社の未来は明るいと強く信じている人が多い",
    },
    { key: 28, question1: "当社の社員であることを誇りに感じている" },
    {
      key: 29,
      question1: "困難な状況であっても、経営層を信頼してついていくつもりだ",
    },
    { key: 30, question1: "組織変革に取り組む必要性を理解している" },
  ],
  question4: [
    {
      key: 31,
      question1:
        "当社のビジョンや将来の目指す姿と、私の価値観は一致していると感じる",
    },
    {
      key: 32,
      question1:
        "組織を変革するために、すぐに「行動したほうがよい」と感じている",
    },
    {
      key: 33,
      question1:
        "組織変革を進めるために求められる努力は、私がそこから得られると思われる利益に比べたら小さいと感じる",
    },
    {
      key: 34,
      question1: "組織変革が実行された際、私にとって何か得るものがある",
    },
    {
      key: 35,
      question1:
        "組織変革に関する行動は、自分の将来にとってもメリットになると感じている",
    },
    { key: 36, question1: "組織変革を進める場合、積極的に取り組みたい" },
    {
      key: 37,
      question1:
        "組織変革に基づく行動をする場合、その行動を阻害する人やルールがあると感じる",
    },
    {
      key: 38,
      question1:
        "組織変革に基づく行動をした場合、その行動を阻害する人やルールが実際にあった",
    },
    {
      key: 39,
      question1: "当社において、私に求められている行動について理解している",
    },
    {
      key: 40,
      question1: "当社において、私が取ってはいけない行動について理解している",
    },
  ],
  question5: [
    {
      key: 41,
      question1:
        "当社において、今、私が変えるべき行動や仕組みは明らかになっている",
    },
    {
      key: 42,
      question1:
        "私が行動した結果を伝えたり、共有したりする人や状況（会議・ワークショップ）、機会がある",
    },
    {
      key: 43,
      question1: "私には、相談したり、サポートしてくれたりする人がいる",
    },
    {
      key: 44,
      question1: "所属チーム（部署）のメンバーも積極的に行動している人が多い",
    },
    {
      key: 45,
      question1:
        "どのような状態になれば、今取り組んでいる変革が成功であるか明らかになっている",
    },
    {
      key: 46,
      question1:
        "自分のアイデアや考えを会社の他の人に利用されないように秘密にする必要があると感じる",
    },
    {
      key: 47,
      question1: "他の人に私の机等の作業スペースに入って欲しくないと感じる",
    },
    { key: 48, question1: "私は会社に貢献する能力・スキルがあると思う" },
    {
      key: 49,
      question1: "私は会社に前向きな変化をもたらすことができると思う",
    },
    {
      key: 50,
      question1:
        "私は、「何かが間違っている」または、「問題がある」と感じた場合、改善を促す働きかけができる",
    },
  ],
  question6: [
    {
      key: 51,
      question1:
        "私は、間違ったことを見つけたり、気づいたりした場合は、ためらわず会社に伝えることができる",
    },
    { key: 52, question1: "私は当社の一員であると感じる" },
    { key: 53, question1: "私は当社で働くことに満足している" },
    { key: 54, question1: "当社の成功は私の成功だと思う" },
    {
      key: 55,
      question1: "当社のビジョン・目標は、私の目指している目標と同じである",
    },
    {
      key: 56,
      question1:
        "仕事をしやすくするために、必要な作業を追加したり不必要な作業を減らしたりするようにしている",
    },
    {
      key: 57,
      question1: "必要と感じた際、新たな作業を自分の仕事に加えるようにしている",
    },
    {
      key: 58,
      question1:
        "仕事の中身や作業手順を自分が望ましいと思うように変更するようにしている",
    },
    { key: 59, question1: "仕事を通じて積極的に人と関わろうとしている" },
    { key: 60, question1: "仕事を通じて関わる人の数を増やそうとしている" },
  ],
  question7: [
    {
      key: 61,
      question1:
        "仕事で関係する人々の状況を把握し、相手の利益になるようにしている",
    },
    {
      key: 62,
      question1:
        "自分の担当する仕事を見つめ直すことによって、やりがいのある仕事にしている",
    },
    {
      key: 63,
      question1:
        "自分の担当する仕事を単なる作業の集まりではなく、全体として意味のあるものだと考えている",
    },
    {
      key: 64,
      question1:
        "自分の担当する仕事の目的がより社会的に意義のあるものであると捉えなおすようにしている",
    },
    { key: 65, question1: "経営層からの情報は信頼できる" },
    {
      key: 66,
      question1:
        "職場や仕事で変化が必要なときには、従業員の意見を事前に聞いてくれる機会がある",
    },
    { key: 67, question1: "一人ひとりの価値観を大事にしてくれる職場である" },
    { key: 68, question1: "人事評価の結果について十分な説明がなされている" },
    {
      key: 69,
      question1:
        "職場では、（正規、非正規、アルバイトなど）いろいろな立場の人が職場の一員として尊重されている",
    },
    {
      key: 70,
      question1: "意欲を引き出したり、キャリアに役立つ教育が行われている",
    },
  ],
  question8: [
    { key: 71, question1: "上司と気軽に話ができる" },
    { key: 72, question1: "私は上司からふさわしい評価を受けている" },
    {
      key: 73,
      question1:
        "上司は、部下が能力をのばす機会を持てるように、取り計らってくれる",
    },
    { key: 74, question1: "上司は誠実な態度で対応してくれる" },
    { key: 75, question1: "同僚や先輩と気軽に話ができる" },
    {
      key: 76,
      question1:
        "現在の所属チーム（部署）の中では、もしあなたが何かミスをしたら、非難されることが多い",
    },
    {
      key: 77,
      question1:
        "現在の所属チーム（部署）のメンバーは、課題や難しい問題を互いに指摘し合うことができる",
    },
    {
      key: 78,
      question1:
        "現在の所属チーム（部署）のメンバーは、自分と異なるということを理由に他者を拒絶・排除するときがある",
    },
    {
      key: 79,
      question1:
        "現在の所属チーム（部署）であれば、安心してリスクをとることができる",
    },
    {
      key: 80,
      question1:
        "現在の所属チーム（部署）の他のメンバーに対して、助けを求めにくい",
    },
  ],
  question9: [
    {
      key: 81,
      question1:
        "現在の所属チーム（部署）のメンバーは、あなたの仕事を意図的におとしめるような行動をしない",
    },
    {
      key: 82,
      question1:
        "現在の所属チーム（部署）のメンバーと仕事をするとき、あなた個人のスキルと才能が尊重され、役に立っている",
    },
    { key: 83, question1: "職を失ってしまうのではないかという不安がある" },
    { key: 84, question1: "たいていのことは自信を持って取り組んでいる" },
    { key: 85, question1: "自分がやってできないことはほとんどないと思う" },
    { key: 86, question1: "どんなことでも、うまくやれると思っている" },
    { key: 87, question1: "何事もそのうちきっとうまくいくと思っている" },
    {
      key: 88,
      question1: "多少の失敗があっても、たいていのことは何とかなると思う",
    },
    { key: 89, question1: "何事も、なるようになると思っている" },
    { key: 90, question1: "人は、私には安心して話ができると言う" },
  ],
  question10: [
    { key: 91, question1: "個人的な相談を持ちかけられることが多い" },
    {
      key: 92,
      question1: "私は人から、その人のプライベートな話を聞かされることが多い",
    },
    { key: 93, question1: "生活の中で達成感を感じる" },
    { key: 94, question1: "生活の中で喜びを感じる" },
    { key: 95, question1: "毎日の生活の中で、充実していると感じる" },
    {
      key: 96,
      question1:
        "私は、会社が掲げるミッションや理念、ビジョンに対して心から貢献したいと考えている",
    },
    {
      key: 97,
      question1: "仕事上で、自分に期待されていることを明確に理解している",
    },
    {
      key: 98,
      question1: "所属チーム（部署）のメンバーと価値観が共通している",
    },
    { key: 99, question1: "仕事で毎日、自分の強みを発揮するチャンスがある" },
    { key: 100, question1: "チームメンバーが私をサポートしてくれる" },
  ],
  question11: [
    { key: 101, question1: "優れた仕事をすれば、認められることがわかっている" },
    { key: 102, question1: "会社の未来は明るいと強く信じている" },
    { key: 103, question1: "仕事では常に成長が求められている" },
    { key: 104, question1: "私は仕事をしていると活力がみなぎるように感じる" },
    { key: 105, question1: "私は仕事に対して熱心に取り組めている" },
    { key: 106, question1: "私は仕事にのめり込んでいる" },
  ],
};

export const BEA_HEADS = [
  {
    label: "かなり当てはまる",
    value: 1,
  },
  {
    label: "当てはまる",
    value: 2,
  },
  {
    label: "少し当てはまる",
    value: 3,
  },
  {
    label: "あまり当てはまらない",
    value: 4,
  },
  {
    label: "当てはまらない",
    value: 5,
  },
  {
    label: "全く当てはまらない",
    value: 6,
  },
];
