export const VFJ_QUESTIONS = {
  question1: [
    {
      key: 1,
      question1:
        "自分がやりたいことを考えていないか、もしくは、気づいていないため、仕事に意欲をもって取り組めない。",
      question2:
        "不快な事態や不利な状況において、冷静さを欠いた行動を取る。もしくは、逃げてしまう。",
    },
    {
      key: 2,
      question1:
        "自分の考えをもたず、他者の意見に流されやすく、集団を率いるような行動が期待できない。",
      question2:
        "自ら周囲に働きかけることはなく、また、周囲と気軽に会話ができず、孤立することがある。",
    },
    {
      key: 3,
      question1: "他者の本当の気持ちが読み取れず、ずれた行動を取ってしまう。",
      question2:
        "自分の考えをきちんと相手に伝えることができず、不適切な意見に対して同調しやすく、反論できない。",
    },
    {
      key: 4,
      question1:
        "自分がやりたいことを考えていないか、もしくは、気づいていないため、仕事に意欲をもって取り組めない。",
      question2:
        "自ら目標をもとうとせず、仕事を受身で行い前向きに取り組もうとしない。",
    },
    {
      key: 5,
      question1:
        "自ら目標をもとうとせず、仕事を受身で行い前向きに取り組もうとしない。",
      question2: "他者の本当の気持ちが読み取れず、ずれた行動を取ってしまう。",
    },
    {
      key: 6,
      question1:
        "自分がやりたいことを考えていないか、もしくは、気づいていないため、仕事に意欲をもって取り組めない。",
      question2:
        "他者を助ける姿勢に欠け、困っている人がいても気づかないふりをする。",
    },
    {
      key: 7,
      question1:
        "相手の感情や立場を理解できず、自分の考えや意見を述べてしまい、周囲と衝突する。",
      question2:
        "自ら周囲に働きかけることはなく、また、周囲と気軽に会話ができず、孤立することがある。",
    },
    {
      key: 8,
      question1:
        "自分を過信して、ミスを繰り返したり、周囲の助言を受け入れようとしない、逆に、自分を過小評価して、チャレンジしようとしない。",
      question2:
        "自分の能力・知識・経験に自信をもてないため、何事にも不安に感じ、自分を卑下するような行動を取る。",
    },
    {
      key: 9,
      question1:
        "環境の変化に適応できず、悲観的な見通ししか立たず、困難と感じたら、あきらめてしまう。",
      question2:
        "自分の考えをきちんと相手に伝えることができず、不適切な意見に対して同調しやすく、反論できない。",
    },
    {
      key: 10,
      question1:
        "自分がやりたいことを考えていないか、もしくは、気づいていないため、仕事に意欲をもって取り組めない。",
      question2:
        "自ら周囲に働きかけることはなく、また、周囲と気軽に会話ができず、孤立することがある。",
    },
  ],
  question2: [
    {
      key: 11,
      question1:
        "自分の能力・知識・経験に自信をもてないため、何事にも不安に感じ、自分を卑下するような行動を取る。",
      question2:
        "相手の感情や立場を理解できず、自分の考えや意見を述べてしまい、周囲と衝突する。",
    },
    {
      key: 12,
      question1:
        "自分を過信して、ミスを繰り返したり、周囲の助言を受け入れようとしない、逆に、自分を過小評価して、チャレンジしようとしない。",
      question2:
        "不快な事態や不利な状況において、冷静さを欠いた行動を取る。もしくは、逃げてしまう。",
    },
    {
      key: 13,
      question1:
        "相手の感情や立場を理解できず、自分の考えや意見を述べてしまい、周囲と衝突する。",
      question2:
        "自分の考えをもたず、他者の意見に流されやすく、集団を率いるような行動が期待できない。",
    },
    {
      key: 14,
      question1:
        "自分を過信して、ミスを繰り返したり、周囲の助言を受け入れようとしない、逆に、自分を過小評価して、チャレンジしようとしない。",
      question2:
        "自ら目標をもとうとせず、仕事を受身で行い前向きに取り組もうとしない。",
    },
    {
      key: 15,
      question1:
        "自ら目標をもとうとせず、仕事を受身で行い前向きに取り組もうとしない。",
      question2:
        "自ら周囲に働きかけることはなく、また、周囲と気軽に会話ができず、孤立することがある。",
    },
    {
      key: 16,
      question1:
        "自分がやりたいことを考えていないか、もしくは、気づいていないため、仕事に意欲をもって取り組めない。",
      question2: "他者の本当の気持ちが読み取れず、ずれた行動を取ってしまう。",
    },
    {
      key: 17,
      question1:
        "自ら目標をもとうとせず、仕事を受身で行い前向きに取り組もうとしない。",
      question2:
        "相手の感情や立場を理解できず、自分の考えや意見を述べてしまい、周囲と衝突する。",
    },
    {
      key: 18,
      question1:
        "自分がやりたいことを考えていないか、もしくは、気づいていないため、仕事に意欲をもって取り組めない。",
      question2:
        "環境の変化に適応できず、悲観的な見通ししか立たず、困難と感じたら、あきらめてしまう。",
    },
    {
      key: 19,
      question1:
        "自分を過信して、ミスを繰り返したり、周囲の助言を受け入れようとしない、逆に、自分を過小評価して、チャレンジしようとしない。",
      question2:
        "他者を助ける姿勢に欠け、困っている人がいても気づかないふりをする。",
    },
    {
      key: 20,
      question1:
        "自分がやりたいことを考えていないか、もしくは、気づいていないため、仕事に意欲をもって取り組めない。",
      question2:
        "相手の感情や立場を理解できず、自分の考えや意見を述べてしまい、周囲と衝突する。",
    },
  ],
  question3: [
    {
      key: 21,
      question1:
        "自分を過信して、ミスを繰り返したり、周囲の助言を受け入れようとしない、逆に、自分を過小評価して、チャレンジしようとしない。",
      question2:
        "自分の考えをきちんと相手に伝えることができず、不適切な意見に対して同調しやすく、反論できない。",
    },
    {
      key: 22,
      question1:
        "自分の能力・知識・経験に自信をもてないため、何事にも不安に感じ、自分を卑下するような行動を取る。",
      question2:
        "自ら目標をもとうとせず、仕事を受身で行い前向きに取り組もうとしない。",
    },
    {
      key: 23,
      question1:
        "不快な事態や不利な状況において、冷静さを欠いた行動を取る。もしくは、逃げてしまう。",
      question2:
        "環境の変化に適応できず、悲観的な見通ししか立たず、困難と感じたら、あきらめてしまう。",
    },
    {
      key: 24,
      question1:
        "自分を過信して、ミスを繰り返したり、周囲の助言を受け入れようとしない、逆に、自分を過小評価して、チャレンジしようとしない。",
      question2:
        "自分の考えをもたず、他者の意見に流されやすく、集団を率いるような行動が期待できない。",
    },
    {
      key: 25,
      question1:
        "自分の能力・知識・経験に自信をもてないため、何事にも不安に感じ、自分を卑下するような行動を取る。",
      question2:
        "環境の変化に適応できず、悲観的な見通ししか立たず、困難と感じたら、あきらめてしまう。",
    },
    {
      key: 26,
      question1:
        "相手の感情や立場を理解できず、自分の考えや意見を述べてしまい、周囲と衝突する。",
      question2:
        "自分の考えをきちんと相手に伝えることができず、不適切な意見に対して同調しやすく、反論できない。",
    },
    {
      key: 27,
      question1:
        "自分の能力・知識・経験に自信をもてないため、何事にも不安に感じ、自分を卑下するような行動を取る。",
      question2: "他者の本当の気持ちが読み取れず、ずれた行動を取ってしまう。",
    },
    {
      key: 28,
      question1:
        "自ら目標をもとうとせず、仕事を受身で行い前向きに取り組もうとしない。",
      question2:
        "環境の変化に適応できず、悲観的な見通ししか立たず、困難と感じたら、あきらめてしまう。",
    },
    {
      key: 29,
      question1:
        "自分を過信して、ミスを繰り返したり、周囲の助言を受け入れようとしない、逆に、自分を過小評価して、チャレンジしようとしない。",
      question2: "他者の本当の気持ちが読み取れず、ずれた行動を取ってしまう。",
    },
    {
      key: 30,
      question1:
        "自分がやりたいことを考えていないか、もしくは、気づいていないため、仕事に意欲をもって取り組めない。",
      question2:
        "自分の考えをもたず、他者の意見に流されやすく、集団を率いるような行動が期待できない。",
    },
  ],
  question4: [
    {
      key: 31,
      question1:
        "自分の能力・知識・経験に自信をもてないため、何事にも不安に感じ、自分を卑下するような行動を取る。",
      question2:
        "他者を助ける姿勢に欠け、困っている人がいても気づかないふりをする。",
    },
    {
      key: 32,
      question1:
        "自ら目標をもとうとせず、仕事を受身で行い前向きに取り組もうとしない。",
      question2:
        "自分の考えをきちんと相手に伝えることができず、不適切な意見に対して同調しやすく、反論できない。",
    },
    {
      key: 33,
      question1:
        "自分の能力・知識・経験に自信をもてないため、何事にも不安に感じ、自分を卑下するような行動を取る。",
      question2:
        "自分の考えをもたず、他者の意見に流されやすく、集団を率いるような行動が期待できない。",
    },
    {
      key: 34,
      question1:
        "不快な事態や不利な状況において、冷静さを欠いた行動を取る。もしくは、逃げてしまう。",
      question2:
        "他者を助ける姿勢に欠け、困っている人がいても気づかないふりをする。",
    },
    {
      key: 35,
      question1:
        "自分の能力・知識・経験に自信をもてないため、何事にも不安に感じ、自分を卑下するような行動を取る。",
      question2:
        "自分の考えをきちんと相手に伝えることができず、不適切な意見に対して同調しやすく、反論できない。",
    },
    {
      key: 36,
      question1:
        "不快な事態や不利な状況において、冷静さを欠いた行動を取る。もしくは、逃げてしまう。",
      question2:
        "自ら目標をもとうとせず、仕事を受身で行い前向きに取り組もうとしない。",
    },
    {
      key: 37,
      question1: "他者の本当の気持ちが読み取れず、ずれた行動を取ってしまう。",
      question2:
        "他者を助ける姿勢に欠け、困っている人がいても気づかないふりをする。",
    },
    {
      key: 38,
      question1:
        "不快な事態や不利な状況において、冷静さを欠いた行動を取る。もしくは、逃げてしまう。",
      question2:
        "相手の感情や立場を理解できず、自分の考えや意見を述べてしまい、周囲と衝突する。",
    },
    {
      key: 39,
      question1:
        "他者を助ける姿勢に欠け、困っている人がいても気づかないふりをする。",
      question2:
        "自分の考えをきちんと相手に伝えることができず、不適切な意見に対して同調しやすく、反論できない。",
    },
    {
      key: 40,
      question1:
        "自分がやりたいことを考えていないか、もしくは、気づいていないため、仕事に意欲をもって取り組めない。",
      question2:
        "自分を過信して、ミスを繰り返したり、周囲の助言を受け入れようとしない、逆に、自分を過小評価して、チャレンジしようとしない。",
    },
  ],
  question5: [
    {
      key: 41,
      question1:
        "環境の変化に適応できず、悲観的な見通ししか立たず、困難と感じたら、あきらめてしまう。",
      question2:
        "相手の感情や立場を理解できず、自分の考えや意見を述べてしまい、周囲と衝突する。",
    },
    {
      key: 42,
      question1:
        "自分を過信して、ミスを繰り返したり、周囲の助言を受け入れようとしない、逆に、自分を過小評価して、チャレンジしようとしない。",
      question2:
        "自ら周囲に働きかけることはなく、また、周囲と気軽に会話ができず、孤立することがある。",
    },
    {
      key: 43,
      question1:
        "不快な事態や不利な状況において、冷静さを欠いた行動を取る。もしくは、逃げてしまう。",
      question2: "他者の本当の気持ちが読み取れず、ずれた行動を取ってしまう。",
    },
    {
      key: 44,
      question1:
        "自ら目標をもとうとせず、仕事を受身で行い前向きに取り組もうとしない。",
      question2:
        "自分の考えをもたず、他者の意見に流されやすく、集団を率いるような行動が期待できない。",
    },
    {
      key: 45,
      question1:
        "環境の変化に適応できず、悲観的な見通ししか立たず、困難と感じたら、あきらめてしまう。",
      question2: "他者の本当の気持ちが読み取れず、ずれた行動を取ってしまう。",
    },
    {
      key: 46,
      question1:
        "自分がやりたいことを考えていないか、もしくは、気づいていないため、仕事に意欲をもって取り組めない。",
      question2:
        "自分の能力・知識・経験に自信をもてないため、何事にも不安に感じ、自分を卑下するような行動を取る。",
    },
    {
      key: 47,
      question1:
        "環境の変化に適応できず、悲観的な見通ししか立たず、困難と感じたら、あきらめてしまう。",
      question2:
        "他者を助ける姿勢に欠け、困っている人がいても気づかないふりをする。",
    },
    {
      key: 48,
      question1:
        "不快な事態や不利な状況において、冷静さを欠いた行動を取る。もしくは、逃げてしまう。",
      question2:
        "自ら周囲に働きかけることはなく、また、周囲と気軽に会話ができず、孤立することがある。",
    },
    {
      key: 49,
      question1:
        "環境の変化に適応できず、悲観的な見通ししか立たず、困難と感じたら、あきらめてしまう。",
      question2:
        "自分の考えをもたず、他者の意見に流されやすく、集団を率いるような行動が期待できない。",
    },
    {
      key: 50,
      question1:
        "自分の能力・知識・経験に自信をもてないため、何事にも不安に感じ、自分を卑下するような行動を取る。",
      question2:
        "自ら周囲に働きかけることはなく、また、周囲と気軽に会話ができず、孤立することがある。",
    },
  ],
  question6: [
    {
      key: 51,
      question1:
        "不快な事態や不利な状況において、冷静さを欠いた行動を取る。もしくは、逃げてしまう。",
      question2:
        "自分の考えをもたず、他者の意見に流されやすく、集団を率いるような行動が期待できない。",
    },
    {
      key: 52,
      question1:
        "環境の変化に適応できず、悲観的な見通ししか立たず、困難と感じたら、あきらめてしまう。",
      question2:
        "自ら周囲に働きかけることはなく、また、周囲と気軽に会話ができず、孤立することがある。",
    },
    {
      key: 53,
      question1:
        "相手の感情や立場を理解できず、自分の考えや意見を述べてしまい、周囲と衝突する。",
      question2: "他者の本当の気持ちが読み取れず、ずれた行動を取ってしまう。",
    },
    {
      key: 54,
      question1: "他者の本当の気持ちが読み取れず、ずれた行動を取ってしまう。",
      question2:
        "自分の考えをもたず、他者の意見に流されやすく、集団を率いるような行動が期待できない。",
    },
    {
      key: 55,
      question1:
        "不快な事態や不利な状況において、冷静さを欠いた行動を取る。もしくは、逃げてしまう。",
      question2:
        "自分の考えをきちんと相手に伝えることができず、不適切な意見に対して同調しやすく、反論できない。",
    },
    {
      key: 56,
      question1: "他者の本当の気持ちが読み取れず、ずれた行動を取ってしまう。",
      question2:
        "自ら周囲に働きかけることはなく、また、周囲と気軽に会話ができず、孤立することがある。",
    },
    {
      key: 57,
      question1:
        "自分の能力・知識・経験に自信をもてないため、何事にも不安に感じ、自分を卑下するような行動を取る。",
      question2:
        "不快な事態や不利な状況において、冷静さを欠いた行動を取る。もしくは、逃げてしまう。",
    },
    {
      key: 58,
      question1:
        "他者を助ける姿勢に欠け、困っている人がいても気づかないふりをする。",
      question2:
        "自分の考えをもたず、他者の意見に流されやすく、集団を率いるような行動が期待できない。",
    },
    {
      key: 59,
      question1:
        "自分を過信して、ミスを繰り返したり、周囲の助言を受け入れようとしない、逆に、自分を過小評価して、チャレンジしようとしない。",
      question2:
        "環境の変化に適応できず、悲観的な見通ししか立たず、困難と感じたら、あきらめてしまう。",
    },
    {
      key: 60,
      question1:
        "自分がやりたいことを考えていないか、もしくは、気づいていないため、仕事に意欲をもって取り組めない。",
      question2:
        "自分の考えをきちんと相手に伝えることができず、不適切な意見に対して同調しやすく、反論できない。",
    },
  ],
  question7: [
    {
      key: 61,
      question1:
        "自ら目標をもとうとせず、仕事を受身で行い前向きに取り組もうとしない。",
      question2:
        "他者を助ける姿勢に欠け、困っている人がいても気づかないふりをする。",
    },
    {
      key: 62,
      question1:
        "他者を助ける姿勢に欠け、困っている人がいても気づかないふりをする。",
      question2:
        "自ら周囲に働きかけることはなく、また、周囲と気軽に会話ができず、孤立することがある。",
    },
    {
      key: 63,
      question1:
        "自分を過信して、ミスを繰り返したり、周囲の助言を受け入れようとしない、逆に、自分を過小評価して、チャレンジしようとしない。",
      question2:
        "相手の感情や立場を理解できず、自分の考えや意見を述べてしまい、周囲と衝突する。",
    },
    {
      key: 64,
      question1:
        "自分の考えをもたず、他者の意見に流されやすく、集団を率いるような行動が期待できない。",
      question2:
        "自分の考えをきちんと相手に伝えることができず、不適切な意見に対して同調しやすく、反論できない。",
    },
    {
      key: 65,
      question1:
        "相手の感情や立場を理解できず、自分の考えや意見を述べてしまい、周囲と衝突する。",
      question2:
        "他者を助ける姿勢に欠け、困っている人がいても気づかないふりをする。",
    },
    {
      key: 66,
      question1:
        "自分の考えをきちんと相手に伝えることができず、不適切な意見に対して同調しやすく、反論できない。",
      question2:
        "自ら周囲に働きかけることはなく、また、周囲と気軽に会話ができず、孤立することがある。",
    },
  ],
};

export const VFJ_HEADS = [
  {
    label: "明確にA",
    value: 1,
  },
  {
    label: "どちらかというとA",
    value: 2,
  },
  {
    label: "どちらかというとB",
    value: 3,
  },
  {
    label: "明確にB",
    value: 4,
  },
];
